Repository: gphoto/libgphoto2
Catalog: libgphoto2_port/po/*.po
Languages: pl

source: Called for filename '%s'.
pl: Wywo³ano dla nazwy pliku '%s'.

source: Could not load '%s': '%s'.
pl: Nie uda³o siê za³adowaæ '%s': '%s'.

source: Could not find some functions in '%s': '%s'.
pl: Nie uda³o siê odnale¼æ funkcji w '%s': '%s'.

source: '%s' already loaded
pl: '%s' ju¿ za³adowany

source: Could not load port driver list: '%s'.
pl: Nie uda³o siê za³adowaæ listy sterowników portów: '%s'.

source: Loaded '%s' ('%s') from '%s'.
pl: Za³adowano '%s' ('%s') z '%s'.

source: Using ltdl to load io-drivers from '%s'...
pl: U¿ycie ltdl do za³adowania sterowników we/wy z '%s'...

source: Counting entries (%i available)...
pl: Liczenie wpisów (%i dostêpnych)...

source: %i regular entries available.
pl: %i dostêpnych zwyk³ych wpisów.

source: Looking for path '%s' (%i entries available)...
pl: Poszukiwanie ¶cie¿ki '%s' (%i dostêpnych wpisów)...

source: Starting regex search for '%s'...
pl: Rozpoczêcie szukania wyra¿enia regularnego dla '%s'...

source: Trying '%s'...
pl: Próbowanie '%s'...

source: regcomp failed
pl: regcomp nie powiod³o siê

source: re_match failed (%i)
pl: re_match nie powiod³o siê (%i)

source: regexec failed
pl: regexec nie powiod³o siê

source: Generic Port
pl: Ogólny port

source: Looking up entry '%s'...
pl: Poszukiwanie wpisu '%s'...

source: Getting info of entry %i (%i available)...
pl: Pobieranie informacji z wpisu %i (%i dostêpnych)...

source: No error
pl: Brak b³êdu

source: Unspecified error
pl: Nieokre¶lony b³±d

source: I/O problem
pl: Problem we/wy

source: Bad parameters
pl: Z³e parametry

source: Unsupported operation
pl: Nieobs³ugiwana operacja

source: Fixed limit exceeded
pl: Przekroczony ustalony limit

source: Timeout reading from or writing to the port
pl: Przekroczony limit czasu przy odczycie lub zapisie do portu

source: Serial port not supported
pl: Port szeregowy nie jest obs³ugiwany

source: USB port not supported
pl: Port USB nie jest obs³ugiwany

source: Unknown port
pl: Nieznany port

source: Out of memory
pl: Brak pamiêci

source: Error loading a library
pl: B³±d podczas ³adowania biblioteki

source: Error initializing the port
pl: B³±d podczas inicjalizacji portu

source: Error reading from the port
pl: B³±d podczas odczytu z portu

source: Error writing to the port
pl: B³±d podczas zapisu do portu

source: Error updating the port settings
pl: B³±d podczas uaktualniania ustawieñ portu

source: Error setting the serial port speed
pl: B³±d podczas ustawiania prêdko¶ci portu szeregowego

source: Error clearing a halt condition on the USB port
pl: B³±d podczas zerowania warunku stopu na pocie USB

source: Could not find the requested device on the USB port
pl: Nie uda³o siê odnale¼æ ¿±danego urz±dzenia na porcie USB

source: Could not claim the USB device
pl: Nie uda³o siê zaw³aszczyæ urz±dzenia USB

source: Could not lock the device
pl: Nie uda³o siê zablokowaæ urz±dzenia

source: libhal error
pl: B³±d libhal

source: Unknown error
pl: Nieznany b³±d

source: The operation '%s' is not supported by this device
pl: Operacja '%s' nie jest obs³ugiwana przez to urz±dzenie

source: The port has not yet been initialized
pl: Port nie zosta³ jeszcze zainicjowany

source: Creating new device...
pl: Tworzenie nowego urz±dzenia...

source: Could not load '%s' ('%s').
pl: Nie uda³o siê za³adowaæ '%s' ('%s').

source: Could not find 'gp_port_library_operations' in '%s' ('%s')
pl: Nie uda³o siê odnale¼æ 'gp_port_library_operations' w '%s' ('%s')

source: Opening %s port...
pl: Otwieranie portu %s...

source: Closing port...
pl: Zamykanie portu...

source: Freeing port...
pl: Zwalnianie portu...

source: Writing %i=0x%x byte(s) to port...
pl: Zapis %i=0x%x bajtów do portu...

source: Could only write %i out of %i byte(s)
pl: Uda³o siê zapisaæ tylko %i z %i bajtów

source: Reading %i=0x%x bytes from port...
pl: Odczyt %i=0x%x bajtów z portu...

source: Could only read %i out of %i byte(s)
pl: Uda³o siê odczytaæ tylko %i z %i bajtów

source: Reading %i=0x%x bytes from interrupt endpoint...
pl: Odczyt %i=0x%x bajtów z koñcówki przerwania...

source: Reading %i=0x%x bytes from interrupt endpoint (fast)...
pl: Odczyt %i=0x%x bajtów z koñcówki przerwania (szybki)...

source: Setting timeout to %i millisecond(s)...
pl: Ustawianie limitu czasu na %i milisekund...

source: Getting timeout...
pl: Pobieranie limitu czasu...

source: Current timeout: %i milliseconds
pl: Bie¿±cy limit czasu: %i milisekund

source: Setting settings...
pl: Ustawianie ustawieñ...

source: Getting level of pin %i...
pl: Pobieranie poziomu pinu %i...

source: Level of pin %i: %i
pl: Poziom pinu %i: %i

source: low
pl: niski

source: high
pl: wysoki

source: Setting pin %i (%s: '%s') to '%s'...
pl: Ustawianie pinu %i (%s: '%s') na '%s'...

source: Sending break (%i milliseconds)...
pl: Wysy³anie sygna³u break (%i milisekund)...

source: Flushing port...
pl: Przeczyszczanie portu...

source: Clear halt...
pl: Zerowanie stopu...

source: Writing message (request=0x%x value=0x%x index=0x%x size=%i=0x%x)...
pl: Zapis komunikatu (¿±danie=0x%x warto¶æ=0x%x indeks=0x%x rozmiar=%i=0x%x)...

source: Reading message (request=0x%x value=0x%x index=0x%x size=%i=0x%x)...
pl: Odczyt komunikatu (¿±danie=0x%x warto¶æ=0x%x indeks=0x%x rozmiar=%i=0x%x)...

source: No error description available
pl: Opis b³êdu niedostêpny

source: Could not lock device '%s'
pl: Nie uda³o siê zablokowaæ urz±dzenia '%s'

source: Device '%s' is locked by pid %d
pl: Urz±dzenie '%s' jest zablokowane przez pid %d

source: Device '%s' could not be locked (dev_lock returned %d)
pl: Urz±dzenie '%s' nie mo¿e zostaæ zablokowane (dev_lock zwróci³o %d)

source: Device '%s' could not be unlocked.
pl: Urz±dzenie '%s' nie mo¿e zostaæ odblokowane.

source: Device '%s' could not be unlocked as it is locked by pid %d.
pl: Urz±dzenie '%s' nie mo¿e zostaæ odblokowane, bo jest zablokowane przez pid %d.

source: Device '%s' could not be unlocked (dev_unlock returned %d)
pl: Urz±dzenie '%s' nie mo¿e zostaæ odblokowane (dev_unlock zwróci³o %d)

source: Serial Port %i
pl: Port szeregowy %i

source: Failed to open '%s' (%m).
pl: Nie uda³o siê otworzyæ '%s' (%m).

source: Could not close '%s' (%m).
pl: Nie uda³o siê zamkn±æ '%s' (%m).

source: Could not write to port (%m)
pl: Nie uda³ siê zapis do portu (%m)

source: Parity error.
pl: B³±d parzysto¶ci.

source: Unexpected parity response sequence 0xff 0x%02x.
pl: Nieoczekiwana sekwencja odpowiedzi parzysto¶ci 0xff 0x%02x.

source: Unknown pin %i.
pl: Nieznany pin %i.

source: Could not get level of pin %i (%m).
pl: Nie uda³o siê pobraæ poziomu pinu %i (%m).

source: Could not set level of pin %i to %i (%m).
pl: Nie uda³o siê ustawiæ poziomu pinu %i na %i (%m).

source: Could not flush '%s' (%m).
pl: Nie uda³o siê przeczy¶ciæ '%s' (%m).

source: Could not set the baudrate to %d
pl: Nie uda³o siê ustawiæ liczby bodów na %d

source: Could not open USB device (%m).
pl: Nie uda³o siê otworzyæ urz±dzenia USB (%m).

source: Camera is already in use.
pl: Aparat jest ju¿ w u¿yciu.

source: Device has driver '%s' attached, detaching it now.
pl: Urz±dzenie ma pod³±czony sterownik '%s', od³±czanie go.

source: Could not detach kernel driver '%s' of camera device.
pl: Nie uda³o siê od³±czyæ sterownika j±dra '%s' od aparatu.

source: Could not query kernel driver of device.
pl: Nie uda³o siê zapytaæ j±dra o sterownik urz±dzenia.

source: Could not claim interface %d (%m). Make sure no other program or kernel module (such as %s) is using the device and you have read/write access to the device.
pl: Nie uda³o siê zaw³aszczyæ interfejsu %d (%m). Nale¿y upewniæ siê, czy ¿aden inny program lub modu³ j±dra (taki jak %s) nie u¿ywa tego urz±dzenia i mamy prawa odczytu/zapisu do urz±dzenia.

source: Could not release interface %d (%m).
pl: Nie uda³o siê oddaæ interfejsu %d (%m).

source: Could not close USB port (%m).
pl: Nie uda³o siê zamkn±æ portu USB (%m).

source: Could not set config %d/%d (%m)
pl: Nie uda³o siê ustawiæ konfiguracji %d/%d (%m)

source: The supplied vendor or product id (0x%x,0x%x) is not valid.
pl: Podany identyfikator producenta lub produktu (0x%x,0x%x) nie jest poprawny.

source: USB device (vendor 0x%x, product 0x%x) is a mass storage device, and might not function with gphoto2. Reference: %s
pl: Urz±dzenie USB (producent 0x%x, produkt 0x%x) to urz±dzenie przechowuj±ce dane i mo¿e nie dzia³aæ z gphoto2. Odno¶nik: %s

source: Could not find USB device (vendor 0x%x, product 0x%x). Make sure this device is connected to the computer.
pl: Nie uda³o siê odnale¼æ urz±dzenia USB (producent 0x%x, produkt 0x%x). Nale¿y upewniæ siê, ¿e to urz±dzenie jest pod³±czone do komputera.

source: Could not find USB device (class 0x%x, subclass 0x%x, protocol 0x%x). Make sure this device is connected to the computer.
pl: Nie uda³o siê odnale¼æ urz±dzenia USB (klasa 0x%x, podklasa 0x%x, protokó³ 0x%x). Nale¿y upewniæ siê, ¿e to urz±dzenie jest pod³±czone do komputera).

source: Media '%s'
pl: No¶nik '%s'

source: (unknown)
pl: (nieznany)
